export default [
  {
    name: '数字',
    val: '^[0-9]*$',
    msg: '请输入数字'
  },
  {
    name: '正整数与0',
    val: '^\\d+$',
    msg: '请输入大于等于0的正整数'
  },
  {
    name: '非0正整数',
    val: '^\\+?[1-9][0-9]*$',
    msg: '请输入大于0的正整数'
  },
  {
    name: '2位小数的正整数',
    val: '^[0-9]+(.[0-9]{2})?$',
    msg: '请输入最多两位小数的数字'
  },
  {
    name: '1-3位小数的正整数',
    val: '^[0-9]+(.[0-9]{1,3})?$',
    msg: '请输入1-3位小数的正整数'
  },
  {
    name: '密码',
    val: '^[a-zA-Z]\\w{5,17}$',
    msg: '以字母开头，长度在6-18之间，只能包含字符、数字和下划线'
  },
  {
    name: '汉字',
    val: '^[\\u2E80-\\u9FFF]+$',
    msg: '只允许输入汉字'
  },
  {
    name: 'Email地址',
    val: '^([a-zA-Z0-9]+[_|\\_|\\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\\_|\\.]?)*[a-zA-Z0-9]+\\.[a-zA-Z]{2,3}$',
    msg: '请输入正确Email地址'
  },
  {
    name: 'URL',
    val: '^http://([\\w-]+\\.)+[\\w-]+(/[\\w-./?%&=]*)?$ ；^[a-zA-z]+://(w+(-w+)*)(.(w+(-w+)*))*(?S*)?$',
    msg: '请输入正确URL'
  },
  {
    name: '电话号码',
    val: '^(\\(\\d{3,4}\\)|\\d{3,4}-)?\\d{7,8}$',
    msg: '请输入正确电话号码'
  },
  {
    name: '手机号码',
    val: '^1[34578]\\d{9}$',
    msg: '请输入正确手机号码'
  },
  {
    name: '身份证号',
    val: '^[1-9]\\d{5}(18|19|([23]\\d))\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}[0-9Xx]$',
    msg: '请输入正确身份证号'
  }
]
